import React from "react";
import "./Bonus.css";

const Bonus = () => {
  return (
    <div>
      <div className="bonus">
        <h3>
          <b>Q-1:</b> How does React Work?
        </h3>
        <p>
          <b>A:</b> React ডমের মতো করে আরেকটা ভার্চুয়াল ডম তৈরি করে। যা একটি
          জাভাস্ক্রিপ্ট অবজেক্ট। React এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে
          সহজেই জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট কম সময়ের মধ্যে modify করা
          যায় । ইউজার যখন ডমে কোনো কিছু চেঞ্জ করে তখন react দুইটা ভার্চুয়াল ডমের
          মধ্যে একটাতে সেই চেঞ্জগুলো রাখে, আর,আরেকটা থাকে আগের মতই। এখন আগেরটার
          সাথে নতুনটার তুলনা করে react দেখে যে আসলে ঠিক কোথায় কোন ইলিমেন্ট
          পরিবর্তন করা হয়েছে। সে অনুসারে react পুরো ডমটাকে chenge না করে
          শুধুমাত্র যেই জিনিসটা চেঞ্জ হয়েছে সেটাকেই চেঞ্জ করে।
          <br /> React ব্লক আকারে component গুলো সাজানো হয় যা অ্যাপ্লিকেশনের সব
          গুলো ইলিমেন্টকে একত্রে রাখতে সহায়তা করে।
        </p>
      </div>
      <div className="bonus">
        <h3>
          <b>Q-2: </b>State VS props?
        </h3>
        <div className="question">
          <div>
            <p>
              <b>A:</b>
              <i>State</i> একটি পরিবর্তন যোগ্য কাঠামো যেটা ডাটা ধারণ করে এবং
              সময়ের সাথে পরিস্থিতি অনুযায়ী পরিবর্তন করে। এটা ব্যবহারকারীর
              ক্রিয়া অনুযায়ী event এর প্রতিক্রিয়া হিসেবে পরিবর্তন হতে পারে।
              এটি শুধুমাত্র উপাদান এর ভেতরে বা সরাসরি উপাদান দ্বারা অ্যাকসেস করা
              বা পরিবর্তন করা যায়। State chaild component দ্বারা access করা
              যায় না। State পুনরায় ব্যবহার যোগ্য করতে পারে না।
            </p>
          </div>
          <div>
            <p>
              <b>Props </b> শুধুমাত্র পঠনযোগ্য উপাদান। এটা অবজেক্ট বা ট্যাগের
              মান ধারণ করে। এবং প্রয়োজন অনুযায়ী বিভিন্ন উপাদানের মধ্যে ব্যবহার
              করা যায়। তবে এই ডাটা গুলো কিন্ঞিত পরিবর্তন করতে পারেনা। Props
              দ্বারা parent এর কাছ থেকে ডাটা নিয়ে chaild component এর মধ্যে
              প্রেরণ করে। কিন্তু chaild component এর কাছ থেকে ডাটা নিয়ে parent
              component এর মধ্যে প্রেরণ করতে পারে না।
            </p>
          </div>
        </div>
      </div>
      <div className="bonus">
        <h3>
          <b>Q-3:</b> How does State Work?
        </h3>
        <p>
          <b>A:</b> useSteate: steate হচ্ছে এমন একটি ডাটা অথবা ভেলু যেটা সময়ের
          সাথে পরিস্থিতি অনুযায়ী চেঞ্জ হয়। Const [count,
          setCiunt]=useSteate(0); useState(0) হচ্ছে একটি ফাংশন যেটি এটি একটি
          initial value গ্রহন করে। useSteate এর দুইটি উপাদান রয়েছে। এর প্রথম
          উপাদান এর ভেলু এবং দ্বিতীয় উপাদান ফাংশন। এই ফাংশন দ্বারাই initial
          value ভেলু পরিবর্তন করে। যখন এর ভেলু পরিবর্তন করতে হবে তখন ঐ ফাংশন কে
          call করলে তা initial value হিসেবে সেট করে দেয়।
        </p>
      </div>
    </div>
  );
};

export default Bonus;
